app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 4)
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at_DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Introduction"], ["body", "Hello, my name is Sandy!"], ["user_id", 1], ["created_at", "2016-10-10 20:49:49.766202"], ["updated_at", "2016-10-10 20:49:49.766202"]]